
&Перед("УстановкаПараметровСеанса")
Процедура a1c_УстановкаПараметровСеанса(ТребуемыеПараметры)
	Если ТребуемыеПараметры = Неопределено Тогда
		Если a1c_ЧатФоновый.ИмяИнформационнойБазы() = "doc3_test" Тогда
			ГлавныйСтиль = БиблиотекаСтилей["СтильАИ1С_Лосось"];
		Иначе
			Если Пользователи.ТекущийПользователь().Наименование = "Жеребятьев Виталий Викторович" Тогда
				//Если a1c_ЧатФоновый.ИмяИнформационнойБазы() = "ca2_update_zhvv" Тогда
				ГлавныйСтиль = БиблиотекаСтилей["СтильАИ1С_Синий"];
				//КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
